{
  "add_a_comment": "Einen Kommentar hinzufügen",
  "add_comment": "Einen Kommentar hinzufügen",
  "add_comment_description": "Seien Sie bitte respektvoll und äußern Sie nur konstruktive Kritik oder Komplimente, wenn Sie einen Kommentar zu diesem Portfolioelement hinzufügen. Außerdem können Sie pro Portfolioelement nur einen Kommentar hinzufügen.",
  "add_comment_disclaimer": "Mir ist bewusst, dass dieser Kommentar vor der Veröffentlichung überprüft wird und jederzeit entfernt werden kann.",
  "anonymous_user": "Anonymer Benutzer",
  "areas_of_expertise": "Fachgebiete",
  "average_daily_hours_coding": "Codierung der durchschnittlichen täglichen Stunden",
  "aws_desc": "Amazon Web Services (AWS) ist eine umfassende, sich weiterentwickelnde Cloud-Computing-Plattform von Amazon. Es bietet eine Mischung aus Infrastructure as a Service (IaaS), Platform as a Service (PaaS) und Packaged Software as a Service (SaaS)-Angeboten. AWS-Services können Organisationen Tools wie Rechenleistung, Datenbankspeicher und Content-Delivery-Services bieten.",
  "back": "Zurück",
  "business_card": "Visitenkarte",
  "business_card_links": "Links zu Visitenkarten",
  "can_integrate_with_aws": "Ich kann mit AWS integrieren",
  "can_integrate_with_firebase": "Ich kann mit Firebase integrieren",
  "can_integrate_with_supabase": "Ich kann mit Supabase integrieren",
  "chakra_ui_desc": "Chakra UI ist eine moderne, zugängliche und benutzerfreundliche React-UI-Bibliothek, die eine Reihe wiederverwendbarer und zusammensetzbarer React-Komponenten bereitstellt. Ziel ist es, Entwicklern das Erstellen schöner, reaktionsfähiger und zugänglicher Benutzeroberflächen für ihre Webanwendungen zu erleichtern. Die Chakra-Benutzeroberfläche ist auf Barrierefreiheit ausgelegt und stellt sicher, dass damit erstellte Anwendungen für ein möglichst breites Publikum zugänglich sind, auch für Menschen mit Behinderungen.",
  "chinese": "Chinesisch",
  "close": "Verstecken",
  "coding_stats_disclaimer": "Die Daten auf dieser Seite stammen aus meinem Wakatime-Profil und werden täglich aktualisiert. Die Statistiken hier zeigen nur die von Wakatime verfolgten Codierungsaktivitäten, die im Jahr 2023 mit der Verfolgung begonnen haben, und umfassen möglicherweise nicht alle von mir durchgeführten Codierungen. Dies dient nur dem Spaß und um zu zeigen, wo ich die meiste Zeit verbringe, also nehmen Sie es mit Vorsicht!",
  "coming_soon": "Demnächst",
  "comment": "Kommentieren",
  "comment_input_placeholder": "Das ist gut. Gut gemacht!",
  "comments": "Kommentare",
  "contact_me": "Kontaktiere mich",
  "create_mobile_apps": "Ich erstelle mobile Apps",
  "create_mobile_apps_with_expo": "Ich erstelle mobile Apps mit Expo",
  "create_mobile_apps_with_react_native": "Ich erstelle mobile Apps mit React Native",
  "create_websites": "Ich erstelle Websites",
  "create_websites_with_chakra": "Ich erstelle Websites mit Chakra UI",
  "create_websites_with_nextjs": "Ich erstelle Websites mit Next.js",
  "create_websites_with_react": "Ich erstelle Websites mit React",
  "django_desc": "Django ist ein High-Level-Python-Webframework, das eine schnelle Entwicklung und ein klares, pragmatisches Design fördert. Es wurde von erfahrenen Entwicklern entwickelt und nimmt Ihnen einen Großteil des Aufwands der Webentwicklung ab, sodass Sie sich auf das Schreiben Ihrer App konzentrieren können, ohne das Rad neu erfinden zu müssen. Es ist kostenlos und Open Source.",
  "english": "Englisch",
  "error__adding_comment__desc": "Beim Hinzufügen des Kommentars ist ein Fehler aufgetreten. Bitte versuche es erneut!",
  "error__comment_already_added__desc": "Sie haben diesem Portfolioelement bereits einen Kommentar hinzugefügt. Sie können pro Portfolioelement nur einen Kommentar hinzufügen.",
  "error__loading_comments__desc": "Beim Laden der Kommentare ist ein Fehler aufgetreten. Bitte versuche es erneut!",
  "error_desc": "Ah, Sie sind zufällig auf unseren exklusiven 500 Club gestoßen – einen Ort, von dem wir nicht dachten, dass Sie ihn finden würden (und ehrlich gesagt auch gehofft hatten, dass Sie ihn finden würden). Während unser Tech-Team alles daran setzt, das Problem zu beheben, bringen wir Sie wieder in Sicherheit.",
  "expo_desc": "Expo ist eine Open-Source-Plattform zur Erstellung universeller nativer Apps für Android, iOS und das Web mit JavaScript und React. Es vereinfacht den Prozess der Erstellung und Bereitstellung mobiler Apps durch die Bereitstellung einer Reihe von Tools und Diensten, die einen Großteil der Komplexität abstrahieren, die mit der Verwaltung nativer Entwicklungsumgebungen verbunden ist. Mit Expo können Entwickler ihre Apps auf realen Geräten und Emulatoren entwickeln und testen, ohne nativen Code konfigurieren zu müssen. Dadurch wird der Entwicklungsprozess schneller und für diejenigen zugänglich, die möglicherweise nicht über umfassende Erfahrung mit der iOS- oder Android-Entwicklung verfügen.",
  "firebase_desc": "Firebase ist eine umfassende App-Entwicklungsplattform von Google, die eine breite Palette an Tools und Diensten bietet, die Entwicklern beim Erstellen, Verbessern und Erweitern ihrer Apps helfen. Seine Dienstleistungen sind in drei Hauptkategorien unterteilt: Build, Release & Monitor und Engage und decken den gesamten App-Entwicklungslebenszyklus von der Entwicklung über die Bereitstellung bis hin zur Analyse ab.",
  "framer_motion_desc": "Framer Motion ist eine beliebte Open-Source-React-Bibliothek zum Erstellen von Animationen und interaktiven Animationen in React-Anwendungen. Es ist einfach, aber leistungsstark konzipiert und bietet eine umfassende Suite an Animationsfunktionen, die dazu beitragen können, das Benutzererlebnis von Webanwendungen zu verbessern. Framer Motion bietet ein hohes Maß an Kontrolle über Animationen und abstrahiert gleichzeitig einen Großteil der Komplexität, die mit der Erstellung komplexer Animationen verbunden ist.",
  "french": "Französisch",
  "front": "Vorderseite",
  "german": "Deutsch",
  "go_home": "Nach Hause gehen",
  "hello_world": "Hallo Welt 👋🏼 Mein Name ist Timothy Caish und",
  "hours_short": "Std.",
  "in_development": "In Entwicklung",
  "japanese": "Japanisch",
  "learn_more": "Erfahren Sie mehr",
  "like": "Gefällt mir",
  "load_more_comments": "Weitere Kommentare laden",
  "loading": "Wird geladen...",
  "love_what_i_do": "Ich liebe, was ich tue!",
  "minutes_short": "Min.",
  "mobile_app": "App",
  "more_areas_of_expertise": "Weitere Fachgebiete",
  "name": "Name",
  "nextjs_desc": "Next.js ist ein Open-Source-React-Frontend-Entwicklungs-Webframework von Vercel (früher bekannt als Zeit), das Funktionen wie serverseitiges Rendering und die Generierung statischer Websites für React-basierte Webanwendungen ermöglicht. Es wurde entwickelt, um Entwicklern das Erstellen schneller, skalierbarer und benutzerfreundlicher Webanwendungen mit React zu erleichtern.",
  "no_comments_yet": "Es gibt noch keine Kommentare zu diesem Portfolioelement. Seien Sie der Erste, der einen Kommentar hinterlässt!",
  "not_found_desc": "Hoppla! Sieht so aus, als hätten Sie die große digitale Leere entdeckt. Leider ist die von Ihnen gesuchte Seite im Cyberspace verschwunden. Aber keine Sorge! Unsere besten digitalen Detektive sind an dem Fall beteiligt. In der Zwischenzeit bringen wir Sie nach Hause.",
  "not_including_today": "Ohne heute",
  "npm_package": "NPM-Paket",
  "portfolio_descriptions": {
    "id-1": "Wir stellen eine umfassende und anpassbare Lösung für die Verwaltung der Cookie-Zustimmung in Ihren React-Anwendungen vor! Unser Paket umfasst eine Reihe leistungsstarker Komponenten, die die Implementierung der Cookie-Einwilligung unkompliziert und im Einklang mit den Benutzerpräferenzen gestalten sollen.",
    "id-2": "Wir sind ein dynamisches Mobil- und Webentwicklungsunternehmen, das sich der Entwicklung innovativer und benutzerfreundlicher digitaler Lösungen verschrieben hat, die es Unternehmen ermöglichen, in der sich ständig weiterentwickelnden Online-Landschaft erfolgreich zu sein.",
    "id-3": "Dies ist ein Spiel, das in der Kindersendung Peppa Pig auftauchte. Das Ziel ist es, so viele Eier wie möglich zu legen!",
    "id-4": "The Village ist eine spezielle Social-Media-App, die ausschließlich für Eltern und Betreuer entwickelt wurde und eine unterstützende und engagierte Community bietet, in der sie Kontakte knüpfen, Erfahrungen austauschen und wertvolle Ressourcen für ihre Erziehungsreise finden können."
  },
  "portuguese": "Portugiesisch",
  "postgresql_desc": "PostgreSQL, oft einfach Postgres, ist ein fortschrittliches, objektrelationales Open-Source-Datenbanksystem, das für seine Zuverlässigkeit, Robustheit und Leistung bekannt ist, insbesondere bei der Verwaltung komplexer Daten-Workloads. PostgreSQL wurde im Laufe von mehr als 30 Jahren Ingenieursarbeit entwickelt und verbessert und genießt einen guten Ruf für seine Architektur, Datenintegrität und seinen umfangreichen Funktionsumfang.",
  "react_desc": "React ist eine JavaScript-Bibliothek zum Erstellen schneller und interaktiver Benutzeroberflächen für Webanwendungen. Es ist komponentenbasiert und ermöglicht es Entwicklern, große Webanwendungen zu erstellen, die Daten ändern können, ohne die Seite neu laden zu müssen. React Native erweitert den Ansatz von React zur Entwicklung mobiler Apps. Im Gegensatz zu Tools, die mobile App-Versionen einer Web-App über Webviews generieren, erstellt React Native wirklich native Apps sowohl für Android- als auch für iOS-Plattformen. Es verwendet das gleiche Design wie React, sodass Sie aus deklarativen Komponenten eine umfangreiche mobile Benutzeroberfläche erstellen können. Mit React Native schreiben Sie Ihre Benutzeroberfläche mit JavaScript und React, aber das Framework übersetzt Ihre Komponenten in plattformnative Komponenten, sodass Ihre App auf native Plattformfunktionen zugreifen und diese nutzen kann.",
  "released": "Veröffentlicht",
  "routes": {
    "contact": "Kontakt",
    "expertise": "Sachverstand",
    "home": "Heim",
    "portfolio": "Portfolio"
  },
  "russian": "Russisch",
  "since_date": "Seit %{date}",
  "since_elipsis": "Seit...",
  "spanish": "Spanisch",
  "submit": "Einreichen",
  "success__comment_added__desc": "Kommentar erfolgreich hinzugefügt! Bitte rechnen Sie mit einigen Werktagen für die Überprüfung.",
  "supabase_desc": "Supabase ist eine Open-Source-Firebase-Alternative und bietet Entwicklern eine Reihe von Tools zum schnellen Erstellen und Skalieren ihrer Anwendungen. Es bietet eine Kombination wichtiger Backend-Dienste, die normalerweise für Web- und mobile Anwendungen erforderlich sind, mit dem Ziel, die Entwicklungsgeschwindigkeit zu erhöhen, ohne den Entwickler an ein bestimmtes Framework oder eine bestimmte Technologie zu binden.",
  "tailwindcss_desc": "Tailwind CSS ist ein Utility-First-CSS-Framework, das eine Reihe von Utility-Klassen bereitstellt, um Entwicklern dabei zu helfen, schnell benutzerdefinierte Designs zu erstellen, ohne benutzerdefiniertes CSS schreiben zu müssen. Es ist so konzipiert, dass es hochgradig anpassbar und benutzerfreundlich ist und es Entwicklern ermöglicht, einzigartige Designs zu erstellen, indem sie Dienstprogrammklassen in ihrem HTML-Markup kombinieren.",
  "this_field_is_required": "Dieses Feld ist erforderlich.",
  "this_is_optional": "Dies ist optional.",
  "top_editors": "Top-Redakteure",
  "top_editors__description": "Das sind die Redakteure, mit denen ich, gemessen an der Anzahl der Stunden, die meiste Zeit verbracht habe.",
  "top_languages": "Top-Sprachen",
  "top_languages__description": "Dies sind die sechs Sprachen, mit denen ich am meisten Zeit verbracht habe, in absteigender Reihenfolge nach Stunden.",
  "total_hours_coding": "Codierung der Gesamtstunden",
  "total_unique_visitors": "Insgesamt einzigartige Besucher",
  "typescript_desc": "TypeScript ist eine typisierte Obermenge von JavaScript, die zu einfachem JavaScript kompiliert wird. Es bietet Klassen, Module und Schnittstellen, die Ihnen beim Aufbau robuster Komponenten helfen.",
  "website": "Webseite",
  "with_blend_of_creativity": "Mit einer Mischung aus Kreativität und technischem Fachwissen brilliere ich als Full-Stack-Entwickler, der Ideen in dynamische Mobil- und Webanwendungen umwandelt, die das Engagement der Benutzer steigern und Unternehmen voranbringen.",
  "zustand_desc": "Zustand ist eine kleine, schnelle und skalierbare Bearbones-Lösung für das Zustandsmanagement. Es hat eine geringe Stellfläche und ist einfach zu bedienen."
}
