{
  "add_a_comment": "Add a Comment",
  "add_comment": "Add Comment",
  "add_comment_description": "Please be respectful and only provide constructive criticism or compliments when adding a comment to this portfolio item. Also, you can only add one comment per portfolio item.",
  "add_comment_disclaimer": "I understand that this comment will be reviewed before being made public and that it may be removed at any time.",
  "anonymous_user": "Anonymous User",
  "areas_of_expertise": "Areas of Expertise",
  "average_daily_hours_coding": "Average Daily Hours Coding",
  "aws_desc": "Amazon Web Services (AWS) is a comprehensive, evolving cloud computing platform provided by Amazon. It offers a mix of infrastructure as a service (IaaS), platform as a service (PaaS), and packaged software as a service (SaaS) offerings. AWS services can offer organizations tools such as compute power, database storage, and content delivery services.",
  "back": "Back",
  "business_card": "Business Card",
  "business_card_links": "Business Card Links",
  "can_integrate_with_aws": "can integrate with AWS",
  "can_integrate_with_firebase": "can integrate with Firebase",
  "can_integrate_with_supabase": "can integrate with Supabase",
  "chakra_ui_desc": "Chakra UI is a modern, accessible, and simple-to-use React UI library that provides a set of reusable and composable React components. It aims to make it easier for developers to build beautiful, responsive, and accessible user interfaces for their web applications. Chakra UI is designed with accessibility in mind, ensuring that applications built with it are accessible to as wide an audience as possible, including people with disabilities.",
  "chinese": "Chinese",
  "close": "Close",
  "coding_stats_disclaimer": "The data on this page comes from my Wakatime profile and is updated daily. The statistics here only show the coding activity tracked by Wakatime, which started tracking in 2023 and may not include all the coding I do. This is only for fun and to show where I spend most of my time, so take it with a grain of salt!",
  "coming_soon": "Coming Soon",
  "comment": "Comment",
  "comment_input_placeholder": "This is good. Great job!",
  "comments": "Comments",
  "contact_me": "Contact Me",
  "create_mobile_apps": "create mobile apps",
  "create_mobile_apps_with_expo": "create mobile apps with Expo",
  "create_mobile_apps_with_react_native": "create mobile apps with React Native",
  "create_websites": "create websites",
  "create_websites_with_chakra": "create websites with Chakra UI",
  "create_websites_with_nextjs": "create websites with Next.js",
  "create_websites_with_react": "create websites with React",
  "django_desc": "Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. Built by experienced developers, it takes care of much of the hassle of web development, so you can focus on writing your app without needing to reinvent the wheel. It's free and open source.",
  "english": "English",
  "error__adding_comment__desc": "There was an error adding the comment. Please try again!",
  "error__comment_already_added__desc": "You have already added a comment to this portfolio item. You can only add one comment per portfolio item.",
  "error__loading_comments__desc": "There was an error loading the comments. Please try again!",
  "error_desc": "Ah, you've stumbled upon our exclusive 500 Club - a place we didn't think you'd find (and frankly, hoped you wouldn't). While our tech team works their magic to fix what's amiss, let's get you back to safety.",
  "expo_desc": "Expo is an open-source platform for making universal native apps for Android, iOS, and the web with JavaScript and React. It simplifies the process of building and deploying mobile apps by providing a set of tools and services that abstract away much of the complexity involved in managing native development environments. With Expo, developers can develop and test their apps on real devices and emulators without having to configure native code, making the development process faster and accessible to those who might not have extensive experience with iOS or Android development.",
  "firebase_desc": "Firebase is a comprehensive app development platform provided by Google, offering a wide array of tools and services to help developers build, improve, and grow their apps. Its services are divided into three main categories: Build, Release & Monitor, and Engage, covering the entire app development lifecycle from development to deployment and analytics.",
  "framer_motion_desc": "Framer Motion is a popular open-source React library for creating animations and interactive animations in React applications. It's designed to be simple yet powerful, offering a comprehensive suite of animation features that can help enhance the user experience of web applications. Framer Motion provides a high level of control over animations while abstracting away much of the complexity involved in creating intricate animations.",
  "french": "French",
  "front": "Front",
  "german": "German",
  "go_home": "Go Home",
  "hello_world": "Hello, world 👋🏼 My name is Timothy Caish, and I",
  "hours_short": "hrs",
  "in_development": "In development",
  "japanese": "Japanese",
  "learn_more": "Learn More",
  "like": "Like",
  "load_more_comments": "Load more comments",
  "loading": "Loading...",
  "love_what_i_do": "love what I do!",
  "minutes_short": "mins",
  "mobile_app": "Mobile App",
  "more_areas_of_expertise": "More Areas of Expertise",
  "name": "Name",
  "nextjs_desc": "Next.js is an open-source React front-end development web framework created by Vercel (formerly known as Zeit) that enables functionality such as server-side rendering and generating static websites for React-based web applications. It's designed to make it easy for developers to build fast, scalable, and user-friendly web applications with React.",
  "no_comments_yet": "There are no comments for this portfolio item yet. Be the first to leave a comment!",
  "not_found_desc": "Oops! Looks like you've discovered the great digital void. Unfortunately, the page you're looking for has vanished into cyberspace. But don't worry! Our best digital detectives are on the case. In the meantime, let's get you home.",
  "not_including_today": "Not including today",
  "npm_package": "NPM Package",
  "portfolio_descriptions": {
    "id-1": "Introducing a comprehensive and customizable solution for managing cookie consent in your React applications! Our package includes a set of powerful components designed to make the implementation of cookie consent straightforward and compliant with user preferences.",
    "id-2": "We are a dynamic mobile and web development company committed to creating innovative and user-friendly digital solutions that empower businesses to thrive in the ever-evolving online landscape.",
    "id-3": "This is a game that made an appearance on the children's show, Peppa Pig. The goal is to lay as many eggs as you can!",
    "id-4": "The Village is a dedicated social media app designed exclusively for parents and caretakers, providing a supportive and engaging community where they can connect, share experiences, and find valuable resources for their parenting journey."
  },
  "portuguese": "Portuguese",
  "postgresql_desc": "PostgreSQL, often simply Postgres, is an advanced, open-source object-relational database system known for its reliability, robustness, and performance, especially when managing complex data workloads. PostgreSQL has been developed and improved over more than 30 years of engineering, boasting a strong reputation for its architecture, data integrity, and extensive feature set.",
  "react_desc": "React is a JavaScript library for building fast and interactive user interfaces for web applications. It is component-based, allowing developers to create large web applications that can change data, without reloading the page. React Native extends React's approach to mobile app development. Unlike tools that generate mobile app versions of a web app through webviews, React Native produces truly native apps for both Android and iOS platforms. It uses the same design as React, letting you compose a rich mobile UI from declarative components. With React Native, you write your UI using JavaScript and React, but the framework translates your components into platform-native components, allowing your app to access and use native platform capabilities.",
  "released": "Released",
  "routes": {
    "contact": "Contact",
    "expertise": "Expertise",
    "home": "Home",
    "portfolio": "Portfolio"
  },
  "russian": "Russian",
  "since_date": " Since %{date}",
  "since_elipsis": "Since...",
  "spanish": "Spanish",
  "submit": "Submit",
  "success__comment_added__desc": "Comment added successfully! Please allow a few business days for it to be reviewed.",
  "supabase_desc": "Supabase is an open-source Firebase alternative, offering developers a suite of tools to rapidly build and scale their applications. It provides a combination of key backend services that are typically required for web and mobile applications, aiming to increase development speed without locking in the developer to a specific framework or technology.",
  "this_field_is_required": "This field is required.",
  "this_is_optional": "This is optional.",
  "top_editors": "Top Editors",
  "top_editors__description": "These are the editors I've spent the most time with based on the amount of hours.",
  "top_languages": "Top Languages",
  "top_languages__description": "These are the top six languages I've spent the most time with in descending order by hours.",
  "total_hours_coding": "Total Hours Coding",
  "total_unique_visitors": "Total unique visitors",
  "website": "Website",
  "with_blend_of_creativity": "With a blend of creativity and technical expertise, I excel as a full stack developer, transforming ideas into dynamic mobile and web applications that enhance user engagement and propel businesses forward."
}
