{
  "add_a_comment": "A침adir un comentario",
  "add_comment": "Agregar comentario",
  "add_comment_description": "Sea respetuoso y proporcione 칰nicamente cr칤ticas constructivas o elogios cuando agregue un comentario a este elemento de la cartera.",
  "add_comment_disclaimer": "Entiendo que este comentario ser치 revisado antes de hacerse p칰blico y que podr치 eliminarse en cualquier momento.",
  "areas_of_expertise": "츼reas de especializaci칩n",
  "average_daily_hours_coding": "Codificaci칩n de horas diarias promedio",
  "aws_desc": "Amazon Web Services (AWS) es una plataforma de computaci칩n en la nube integral y en evoluci칩n proporcionada por Amazon. Ofrece una combinaci칩n de ofertas de infraestructura como servicio (IaaS), plataforma como servicio (PaaS) y software como servicio (SaaS). Los servicios de AWS pueden ofrecer a las organizaciones herramientas como potencia inform치tica, almacenamiento de bases de datos y servicios de entrega de contenido.",
  "back": "Atr치s",
  "business_card": "Tarjeta de visita",
  "business_card_links": "Enlaces de tarjetas de presentaci칩n",
  "can_integrate_with_aws": "puedo integrarme con AWS",
  "can_integrate_with_firebase": "puedo integrarme con Firebase",
  "can_integrate_with_supabase": "puedo integrarme con Supabase",
  "chakra_ui_desc": "Chakra UI es una biblioteca de React UI moderna, accesible y f치cil de usar que proporciona un conjunto de componentes de React reutilizables y componibles. Su objetivo es facilitar a los desarrolladores la creaci칩n de interfaces de usuario hermosas, receptivas y accesibles para sus aplicaciones web. La interfaz de usuario de Chakra est치 dise침ada teniendo en cuenta la accesibilidad, lo que garantiza que las aplicaciones creadas con ella sean accesibles para una audiencia lo m치s amplia posible, incluidas las personas con discapacidades.",
  "chinese": "Chino",
  "close": "Cerca",
  "coding_stats_disclaimer": "Los datos de esta p치gina provienen de mi perfil de Wakatime y se actualizan diariamente. Las estad칤sticas aqu칤 solo muestran la actividad de codificaci칩n rastreada por Wakatime, que comenz칩 a rastrearse en 2023 y es posible que no incluya toda la codificaci칩n que hago. Esto es s칩lo por diversi칩n y para mostrar d칩nde paso la mayor parte de mi tiempo, 춰as칤 que t칩malo con cautela!",
  "coming_soon": "Muy pronto",
  "comment": "Comentar",
  "comment_input_placeholder": "Esto es bueno. 춰Gran trabajo!",
  "comments": "Comentarios",
  "contact_me": "Cont치ctame",
  "create_mobile_apps": "creo aplicaciones m칩viles",
  "create_mobile_apps_with_expo": "creo aplicaciones m칩viles con Expo",
  "create_mobile_apps_with_react_native": "creo aplicaciones m칩viles con React Native",
  "create_websites": "creo sitios web",
  "create_websites_with_chakra": "creo sitios web con Chakra UI",
  "create_websites_with_nextjs": "creo sitios web con Next.js",
  "create_websites_with_react": "creo sitios web con React",
  "django_desc": "Django es un marco web Python de alto nivel que fomenta un desarrollo r치pido y un dise침o limpio y pragm치tico. Creado por desarrolladores experimentados, se encarga de gran parte de las molestias del desarrollo web, para que puedas concentrarte en escribir tu aplicaci칩n sin necesidad de reinventar la rueda. Es gratuito y de c칩digo abierto.",
  "english": "Ingl칠s",
  "error_desc": "Ah, te topaste con nuestro exclusivo 500 Club, un lugar que no pens치bamos que encontrar칤as (y, francamente, esper치bamos que no lo encontraras). Mientras nuestro equipo t칠cnico hace su magia para solucionar el problema, vamos a llevarlo a un lugar seguro.",
  "expo_desc": "Expo es una plataforma de c칩digo abierto para crear aplicaciones nativas universales para Android, iOS y la web con JavaScript y React. Simplifica el proceso de creaci칩n e implementaci칩n de aplicaciones m칩viles al proporcionar un conjunto de herramientas y servicios que abstraen gran parte de la complejidad involucrada en la gesti칩n de entornos de desarrollo nativos. Con Expo, los desarrolladores pueden desarrollar y probar sus aplicaciones en dispositivos y emuladores reales sin tener que configurar el c칩digo nativo, lo que hace que el proceso de desarrollo sea m치s r치pido y accesible para aquellos que no tengan una amplia experiencia con el desarrollo de iOS o Android.",
  "firebase_desc": "Firebase es una plataforma integral de desarrollo de aplicaciones proporcionada por Google que ofrece una amplia gama de herramientas y servicios para ayudar a los desarrolladores a crear, mejorar y hacer crecer sus aplicaciones. Sus servicios se dividen en tres categor칤as principales: compilaci칩n, lanzamiento y monitoreo y participaci칩n, y cubren todo el ciclo de vida del desarrollo de aplicaciones, desde el desarrollo hasta la implementaci칩n y el an치lisis.",
  "framer_motion_desc": "Framer Motion es una popular biblioteca React de c칩digo abierto para crear animaciones y animaciones interactivas en aplicaciones React. Est치 dise침ado para ser simple pero potente y ofrece un conjunto completo de funciones de animaci칩n que pueden ayudar a mejorar la experiencia del usuario de las aplicaciones web. Framer Motion proporciona un alto nivel de control sobre las animaciones y al mismo tiempo abstrae gran parte de la complejidad involucrada en la creaci칩n de animaciones complejas.",
  "french": "Franc칠s",
  "front": "Frente",
  "german": "Alem치n",
  "go_home": "Vete a casa",
  "hello_world": "Hola mundo 游녦游낖 Me llamo Timothy Caish y",
  "hours_short": "hrs",
  "in_development": "En desarrollo",
  "japanese": "Japon칠s",
  "learn_more": "Aprende m치s",
  "like": "Me gusta",
  "loading": "Cargando...",
  "love_what_i_do": "춰Amo lo que hago!",
  "minutes_short": "mins",
  "mobile_app": "Aplicaci칩n movil",
  "more_areas_of_expertise": "M치s 치reas de especializaci칩n",
  "name": "Nombre",
  "nextjs_desc": "Next.js es un marco web de desarrollo front-end de React de c칩digo abierto creado por Vercel (anteriormente conocido como Zeit) que permite funciones como la representaci칩n del lado del servidor y la generaci칩n de sitios web est치ticos para aplicaciones web basadas en React. Est치 dise침ado para facilitar a los desarrolladores la creaci칩n de aplicaciones web r치pidas, escalables y f치ciles de usar con React.",
  "no_comments_yet": "A칰n no hay comentarios para este art칤culo de cartera. 춰S칠 el primero en dejar un comentario!",
  "not_found_desc": "춰Ups! Parece que has descubierto el gran vac칤o digital. Lamentablemente, la p치gina que busca ha desaparecido en el ciberespacio. 춰Pero no te preocupes! Nuestros mejores detectives digitales est치n en el caso. Mientras tanto, te llevaremos a casa.",
  "not_including_today": "Sin incluir hoy",
  "npm_package": "Paquete MNP",
  "portfolio_descriptions": {
    "id-1": "춰Presentamos una soluci칩n integral y personalizable para administrar el consentimiento de cookies en sus aplicaciones React! Nuestro paquete incluye un conjunto de potentes componentes dise침ados para que la implementaci칩n del consentimiento de cookies sea sencilla y cumpla con las preferencias del usuario."
  },
  "portuguese": "Portugu칠s",
  "postgresql_desc": "PostgreSQL, a menudo simplemente Postgres, es un sistema avanzado de base de datos relacional de objetos de c칩digo abierto conocido por su confiabilidad, solidez y rendimiento, especialmente cuando se administran cargas de trabajo de datos complejas. PostgreSQL se ha desarrollado y mejorado a lo largo de m치s de 30 a침os de ingenier칤a y cuenta con una s칩lida reputaci칩n por su arquitectura, integridad de datos y amplio conjunto de funciones.",
  "react_desc": "React es una biblioteca de JavaScript para crear interfaces de usuario r치pidas e interactivas para aplicaciones web. Est치 basado en componentes, lo que permite a los desarrolladores crear grandes aplicaciones web que pueden cambiar datos sin recargar la p치gina. React Native ampl칤a el enfoque de React al desarrollo de aplicaciones m칩viles. A diferencia de las herramientas que generan versiones de aplicaciones m칩viles de una aplicaci칩n web a trav칠s de vistas web, React Native produce aplicaciones verdaderamente nativas para plataformas Android e iOS. Utiliza el mismo dise침o que React, lo que le permite componer una interfaz de usuario m칩vil enriquecida a partir de componentes declarativos. Con React Native, usted escribe su interfaz de usuario usando JavaScript y React, pero el marco traduce sus componentes en componentes nativos de la plataforma, lo que permite que su aplicaci칩n acceda y utilice las capacidades de la plataforma nativa.",
  "released": "Publicado",
  "routes": {
    "contact": "Contacto",
    "expertise": "Pericia",
    "home": "Hogar",
    "portfolio": "Portafolio"
  },
  "russian": "Ruso",
  "since_date": "Desde %{date}",
  "since_elipsis": "Desde...",
  "spanish": "Espa침ol",
  "submit": "Entregar",
  "supabase_desc": "Supabase es una alternativa de c칩digo abierto a Firebase que ofrece a los desarrolladores un conjunto de herramientas para crear y escalar r치pidamente sus aplicaciones. Proporciona una combinaci칩n de servicios backend clave que normalmente se requieren para aplicaciones web y m칩viles, con el objetivo de aumentar la velocidad de desarrollo sin limitar al desarrollador a un marco o tecnolog칤a espec칤fica.",
  "this_field_is_required": "Este campo es obligatorio.",
  "this_is_optional": "Esto es opcional.",
  "top_editors": "Editores principales",
  "top_editors__description": "Estos son los editores con los que he pasado m치s tiempo seg칰n la cantidad de horas.",
  "top_languages": "Idiomas principales",
  "top_languages__description": "Estos son los seis idiomas principales con los que he pasado m치s tiempo en orden descendente por horas.",
  "total_hours_coding": "Codificaci칩n de horas totales",
  "total_unique_visitors": "Visitantes 칰nicos totales",
  "website": "Sitio web",
  "with_blend_of_creativity": "Con una combinaci칩n de creatividad y experiencia t칠cnica, me destaco como desarrollador completo, transformando ideas en aplicaciones m칩viles y web din치micas que mejoran la participaci칩n del usuario e impulsan a las empresas hacia adelante."
}
