{
  "average_daily_hours_coding": "Codificaci贸n de horas diarias promedio",
  "aws_desc": "Amazon Web Services (AWS) es una plataforma de computaci贸n en la nube integral y en evoluci贸n proporcionada por Amazon. Ofrece una combinaci贸n de ofertas de infraestructura como servicio (IaaS), plataforma como servicio (PaaS) y software como servicio (SaaS). Los servicios de AWS pueden ofrecer a las organizaciones herramientas como potencia inform谩tica, almacenamiento de bases de datos y servicios de entrega de contenido.",
  "can_integrate_with_aws": "puedo integrarme con AWS",
  "can_integrate_with_firebase": "puedo integrarme con Firebase",
  "can_integrate_with_supabase": "puedo integrarme con Supabase",
  "chakra_ui_desc": "Chakra UI es una biblioteca de React UI moderna, accesible y f谩cil de usar que proporciona un conjunto de componentes de React reutilizables y componibles. Su objetivo es facilitar a los desarrolladores la creaci贸n de interfaces de usuario hermosas, receptivas y accesibles para sus aplicaciones web. La interfaz de usuario de Chakra est谩 dise帽ada teniendo en cuenta la accesibilidad, lo que garantiza que las aplicaciones creadas con ella sean accesibles para una audiencia lo m谩s amplia posible, incluidas las personas con discapacidades.",
  "chinese": "Chino",
  "coding_stats_disclaimer": "Los datos de esta p谩gina provienen de mi perfil de Wakatime y se actualizan diariamente. Las estad铆sticas aqu铆 solo muestran la actividad de codificaci贸n rastreada por Wakatime, que comenz贸 a rastrearse en 2023 y es posible que no incluya toda la codificaci贸n que hago. Esto es s贸lo por diversi贸n y para mostrar d贸nde paso la mayor parte de mi tiempo, 隆as铆 que t贸malo con cautela!",
  "contact_me": "Cont谩ctame",
  "create_mobile_apps": "creo aplicaciones m贸viles",
  "create_mobile_apps_with_expo": "creo aplicaciones m贸viles con Expo",
  "create_mobile_apps_with_react_native": "creo aplicaciones m贸viles con React Native",
  "create_websites": "creo sitios web",
  "create_websites_with_chakra": "creo sitios web con Chakra UI",
  "create_websites_with_nextjs": "creo sitios web con Next.js",
  "create_websites_with_react": "creo sitios web con React",
  "django_desc": "Django es un marco web Python de alto nivel que fomenta un desarrollo r谩pido y un dise帽o limpio y pragm谩tico. Creado por desarrolladores experimentados, se encarga de gran parte de las molestias del desarrollo web, para que puedas concentrarte en escribir tu aplicaci贸n sin necesidad de reinventar la rueda. Es gratuito y de c贸digo abierto.",
  "english": "Ingl茅s",
  "expo_desc": "Expo es una plataforma de c贸digo abierto para crear aplicaciones nativas universales para Android, iOS y la web con JavaScript y React. Simplifica el proceso de creaci贸n e implementaci贸n de aplicaciones m贸viles al proporcionar un conjunto de herramientas y servicios que abstraen gran parte de la complejidad involucrada en la gesti贸n de entornos de desarrollo nativos. Con Expo, los desarrolladores pueden desarrollar y probar sus aplicaciones en dispositivos y emuladores reales sin tener que configurar el c贸digo nativo, lo que hace que el proceso de desarrollo sea m谩s r谩pido y accesible para aquellos que no tengan una amplia experiencia con el desarrollo de iOS o Android.",
  "firebase_desc": "Firebase es una plataforma integral de desarrollo de aplicaciones proporcionada por Google que ofrece una amplia gama de herramientas y servicios para ayudar a los desarrolladores a crear, mejorar y hacer crecer sus aplicaciones. Sus servicios se dividen en tres categor铆as principales: compilaci贸n, lanzamiento y monitoreo y participaci贸n, y cubren todo el ciclo de vida del desarrollo de aplicaciones, desde el desarrollo hasta la implementaci贸n y el an谩lisis.",
  "framer_motion_desc": "Framer Motion es una popular biblioteca React de c贸digo abierto para crear animaciones y animaciones interactivas en aplicaciones React. Est谩 dise帽ado para ser simple pero potente y ofrece un conjunto completo de funciones de animaci贸n que pueden ayudar a mejorar la experiencia del usuario de las aplicaciones web. Framer Motion proporciona un alto nivel de control sobre las animaciones y al mismo tiempo abstrae gran parte de la complejidad involucrada en la creaci贸n de animaciones complejas.",
  "french": "Franc茅s",
  "german": "Alem谩n",
  "hello_world": "Hola mundo  Me llamo Timothy Caish y",
  "hours_short": "hrs",
  "in_development": "En desarrollo",
  "japanese": "Japon茅s",
  "learn_more": "Aprende m谩s",
  "love_what_i_do": "隆Amo lo que hago!",
  "minutes_short": "mins",
  "more_areas_of_expertise": "M谩s 谩reas de especializaci贸n",
  "my_skillset": "Mis habilidades",
  "nextjs_desc": "Next.js es un marco web de desarrollo front-end de React de c贸digo abierto creado por Vercel (anteriormente conocido como Zeit) que permite funciones como la representaci贸n del lado del servidor y la generaci贸n de sitios web est谩ticos para aplicaciones web basadas en React. Est谩 dise帽ado para facilitar a los desarrolladores la creaci贸n de aplicaciones web r谩pidas, escalables y f谩ciles de usar con React.",
  "not_including_today": "Sin incluir hoy",
  "portuguese": "Portugu茅s",
  "postgresql_desc": "PostgreSQL, a menudo simplemente Postgres, es un sistema avanzado de base de datos relacional de objetos de c贸digo abierto conocido por su confiabilidad, solidez y rendimiento, especialmente cuando se administran cargas de trabajo de datos complejas. PostgreSQL se ha desarrollado y mejorado a lo largo de m谩s de 30 a帽os de ingenier铆a y cuenta con una s贸lida reputaci贸n por su arquitectura, integridad de datos y amplio conjunto de funciones.",
  "react_desc": "React es una biblioteca de JavaScript para crear interfaces de usuario r谩pidas e interactivas para aplicaciones web. Est谩 basado en componentes, lo que permite a los desarrolladores crear grandes aplicaciones web que pueden cambiar datos sin recargar la p谩gina. React Native ampl铆a el enfoque de React al desarrollo de aplicaciones m贸viles. A diferencia de las herramientas que generan versiones de aplicaciones m贸viles de una aplicaci贸n web a trav茅s de vistas web, React Native produce aplicaciones verdaderamente nativas para plataformas Android e iOS. Utiliza el mismo dise帽o que React, lo que le permite componer una interfaz de usuario m贸vil enriquecida a partir de componentes declarativos. Con React Native, usted escribe su interfaz de usuario usando JavaScript y React, pero el marco traduce sus componentes en componentes nativos de la plataforma, lo que permite que su aplicaci贸n acceda y utilice las capacidades de la plataforma nativa.",
  "russian": "Ruso",
  "since_date": "Desde %{date}",
  "since_elipsis": "Desde...",
  "spanish": "Espa帽ol",
  "supabase_desc": "Supabase es una alternativa de c贸digo abierto a Firebase que ofrece a los desarrolladores un conjunto de herramientas para crear y escalar r谩pidamente sus aplicaciones. Proporciona una combinaci贸n de servicios backend clave que normalmente se requieren para aplicaciones web y m贸viles, con el objetivo de aumentar la velocidad de desarrollo sin limitar al desarrollador a un marco o tecnolog铆a espec铆fica.",
  "top_editors": "Editores principales",
  "top_editors__description": "Estos son los editores con los que he pasado m谩s tiempo seg煤n la cantidad de horas.",
  "top_languages": "Idiomas principales",
  "top_languages__description": "Estos son los seis idiomas principales con los que he pasado m谩s tiempo en orden descendente por horas.",
  "total_hours_coding": "Codificaci贸n de horas totales",
  "total_unique_visitors": "Visitantes 煤nicos totales",
  "with_blend_of_creativity": "Con una combinaci贸n de creatividad y experiencia t茅cnica, me destaco como desarrollador completo, transformando ideas en aplicaciones m贸viles y web din谩micas que mejoran la participaci贸n del usuario e impulsan a las empresas hacia adelante."
}
