{
  "average_daily_hours_coding": "Codage des heures quotidiennes moyennes",
  "aws_desc": "Amazon Web Services (AWS) est une plate-forme de cloud computing complète et évolutive fournie par Amazon. Il propose un mélange d'offres d'infrastructure en tant que service (IaaS), de plate-forme en tant que service (PaaS) et de logiciels en tant que service (SaaS). Les services AWS peuvent offrir aux organisations des outils tels que la puissance de calcul, le stockage de bases de données et les services de diffusion de contenu.",
  "can_integrate_with_aws": "je peux intégrer AWS",
  "can_integrate_with_firebase": "je peux intégrer Firebase",
  "can_integrate_with_supabase": "je peux intégrer Supabase",
  "chakra_ui_desc": "Chakra UI est une bibliothèque d'interface utilisateur React moderne, accessible et simple à utiliser qui fournit un ensemble de composants React réutilisables et composables. Il vise à permettre aux développeurs de créer plus facilement des interfaces utilisateur belles, réactives et accessibles pour leurs applications Web. Chakra UI est conçu dans un souci d'accessibilité, garantissant que les applications créées avec celui-ci sont accessibles à un public aussi large que possible, y compris les personnes handicapées.",
  "chinese": "chinois",
  "coding_stats_disclaimer": "Les données de cette page proviennent de mon profil Wakatime et sont mises à jour quotidiennement. Les statistiques ici montrent uniquement l'activité de codage suivie par Wakatime, qui a commencé à suivre en 2023 et peuvent ne pas inclure tout le codage que je fais. C'est uniquement pour m'amuser et pour montrer où je passe le plus clair de mon temps, alors prenez-le avec précaution!",
  "contact_me": "Contactez moi",
  "create_mobile_apps": "je crée des applications mobiles",
  "create_mobile_apps_with_expo": "je crée des applications mobiles avec Expo",
  "create_mobile_apps_with_react_native": "je crée des applications mobiles avec React Native",
  "create_websites": "je crée des sites web",
  "create_websites_with_chakra": "je crée des sites web avec Chakra UI",
  "create_websites_with_nextjs": "je crée des sites web avec Next.js",
  "create_websites_with_react": "je crée des sites web avec React",
  "django_desc": "Django est un framework Web Python de haut niveau qui encourage un développement rapide et une conception épurée et pragmatique. Construit par des développeurs expérimentés, il prend en charge une grande partie des tracas du développement Web, afin que vous puissiez vous concentrer sur l'écriture de votre application sans avoir à réinventer la roue. C'est gratuit et open source.",
  "english": "englais",
  "error_desc": "Ah, vous êtes tombé sur notre exclusif 500 Club - un endroit que nous ne pensions pas que vous trouveriez (et franchement, nous espérions que vous ne le trouveriez pas). Pendant que notre équipe technique opère sa magie pour réparer ce qui ne va pas, remettons-nous en sécurité.",
  "expo_desc": "Expo est une plate-forme open source permettant de créer des applications natives universelles pour Android, iOS et le Web avec JavaScript et React. Il simplifie le processus de création et de déploiement d'applications mobiles en fournissant un ensemble d'outils et de services qui éliminent une grande partie de la complexité impliquée dans la gestion des environnements de développement natifs. Avec Expo, les développeurs peuvent développer et tester leurs applications sur de vrais appareils et émulateurs sans avoir à configurer le code natif, ce qui rend le processus de développement plus rapide et accessible à ceux qui n'ont pas une vaste expérience du développement iOS ou Android.",
  "firebase_desc": "Firebase est une plate-forme complète de développement d'applications fournie par Google, offrant un large éventail d'outils et de services pour aider les développeurs à créer, améliorer et développer leurs applications. Ses services sont divisés en trois catégories principales : Build, Release & Monitor et Engage, couvrant l'ensemble du cycle de vie du développement d'applications, du développement au déploiement et à l'analyse.",
  "framer_motion_desc": "Framer Motion est une bibliothèque React open source populaire pour créer des animations et des animations interactives dans les applications React. Il est conçu pour être simple mais puissant, offrant une suite complète de fonctionnalités d'animation qui peuvent contribuer à améliorer l'expérience utilisateur des applications Web. Framer Motion offre un haut niveau de contrôle sur les animations tout en éliminant une grande partie de la complexité impliquée dans la création d'animations complexes.",
  "french": "français",
  "german": "allemand",
  "go_home": "Rentrer chez soi",
  "hello_world": "Bonjour tout le monde 👋🏼 Je m'appelle Timothy Caish et",
  "hours_short": "hrs",
  "in_development": "En développement",
  "japanese": "japonais",
  "learn_more": "Apprendre encore plus",
  "loading": "Chargement...",
  "love_what_i_do": "j'aime ce que je fais !",
  "minutes_short": "mins",
  "more_areas_of_expertise": "Plus de domaines d'expertise",
  "my_skillset": "Mes compétences",
  "nextjs_desc": "Next.js est un framework Web de développement frontal React open source créé par Vercel (anciennement connu sous le nom de Zeit) qui permet des fonctionnalités telles que le rendu côté serveur et la génération de sites Web statiques pour les applications Web basées sur React. Il est conçu pour permettre aux développeurs de créer facilement des applications Web rapides, évolutives et conviviales avec React.",
  "not_found_desc": "Oops! On dirait que vous avez découvert le grand vide numérique. Malheureusement, la page que vous recherchez a disparu dans le cyberespace. Mais ne vous inquiétez pas ! Nos meilleurs détectives numériques sont sur l'affaire. En attendant, rentrons à la maison.",
  "not_including_today": "Sans compter aujourd'hui",
  "portuguese": "portugais",
  "postgresql_desc": "PostgreSQL, souvent simplement Postgres, est un système de base de données relationnelle objet open source avancé, connu pour sa fiabilité, sa robustesse et ses performances, en particulier lors de la gestion de charges de travail de données complexes. PostgreSQL a été développé et amélioré au cours de plus de 30 ans d'ingénierie, bénéficiant d'une solide réputation pour son architecture, l'intégrité de ses données et son ensemble complet de fonctionnalités.",
  "react_desc": "React est une bibliothèque JavaScript permettant de créer des interfaces utilisateur rapides et interactives pour les applications Web. Il est basé sur des composants, permettant aux développeurs de créer de grandes applications Web capables de modifier les données, sans recharger la page. React Native étend l'approche de React au développement d'applications mobiles. Contrairement aux outils qui génèrent des versions d'applications mobiles d'une application Web via des vues Web, React Native produit des applications véritablement natives pour les plates-formes Android et iOS. Il utilise la même conception que React, vous permettant de composer une interface utilisateur mobile riche à partir de composants déclaratifs. Avec React Native, vous écrivez votre interface utilisateur à l'aide de JavaScript et de React, mais le framework traduit vos composants en composants natifs de la plate-forme, permettant à votre application d'accéder et d'utiliser les fonctionnalités natives de la plate-forme.",
  "russian": "russe",
  "since_date": "Depuis le %{date}",
  "since_elipsis": "Depuis...",
  "spanish": "espagnol",
  "top_editors": "Meilleurs éditeurs",
  "top_editors__description": "Ce sont les éditeurs avec lesquels j'ai passé le plus de temps en fonction du nombre d'heures.",
  "top_languages": "Principales langues",
  "top_languages__description": "Ce sont les six langues avec lesquelles j'ai passé le plus de temps, par ordre décroissant d'heures.",
  "total_hours_coding": "Codage des heures totales",
  "total_unique_visitors": "Nombre total de visiteurs uniques",
  "with_blend_of_creativity": "Avec un mélange de créativité et d'expertise technique, j'excelle en tant que développeur full stack, transformant des idées en applications mobiles et Web dynamiques qui améliorent l'engagement des utilisateurs et propulsent les entreprises vers l'avant."
}
