{
  "average_daily_hours_coding": "1 日の平均コーディング時間",
  "aws_desc": "アマゾン ウェブ サービス (AWS) は、Amazon が提供する包括的で進化するクラウド コンピューティング プラットフォームです。これは、サービスとしてのインフラストラクチャー (IaaS)、サービスとしてのプラットフォーム (PaaS)、およびサービスとしてのパッケージ化されたソフトウェア (SaaS) の製品を組み合わせて提供します。 AWS のサービスは、コンピューティング能力、データベースストレージ、コンテンツ配信サービスなどのツールを組織に提供できます。",
  "can_integrate_with_aws": "AWS と統合できます",
  "can_integrate_with_firebase": "Firebase と統合できます",
  "can_integrate_with_supabase": "Supabase と統合できます",
  "chakra_ui_desc": "Chakra UI は、再利用可能で構成可能な React コンポーネントのセットを提供する、モダンでアクセスしやすく、使いやすい React UI ライブラリです。これは、開発者が Web アプリケーション用に美しく、応答性が高く、アクセスしやすいユーザー インターフェイスを簡単に構築できるようにすることを目的としています。 Chakra UI はアクセシビリティを念頭に置いて設計されており、これで構築されたアプリケーションは、障害のある人を含むできるだけ幅広いユーザーがアクセスできるようになります。",
  "chinese": "中国語",
  "coding_stats_disclaimer": "このページのデータは私のWakatimeプロフィールから取得したもので、毎日更新されます。 ここでの統計は、Wakatime によって追跡されたコーディング アクティビティのみを示しています。Wakatime は 2023 年に追跡を開始しており、私が行っているすべてのコーディングが含まれていない可能性があります。 これは単なる趣味であり、私が最も多くの時間を費やしている場所を示すためのものなので、話半分に聞いてください。",
  "contact_me": "私に連絡して",
  "create_mobile_apps": "モバイル アプリを作成します",
  "create_mobile_apps_with_expo": "Expo を使用してモバイル アプリを作成します",
  "create_mobile_apps_with_react_native": "React Native を使用してモバイル アプリを作成します",
  "create_websites": "Web サイトを作成します",
  "create_websites_with_chakra": "Chakra UI を使用して Web サイトを作成します",
  "create_websites_with_nextjs": "Next.js を使用して Web サイトを作成します",
  "create_websites_with_react": "React を使用して Web サイトを作成します",
  "django_desc": "Django は、迅速な開発とクリーンで実用的な設計を促進する高レベルの Python Web フレームワークです。経験豊富な開発者によって構築されており、Web 開発の面倒な作業の多くが処理されるため、車輪の再発明をすることなくアプリの作成に集中できます。無料でオープンソースです。",
  "english": "英語",
  "expo_desc": "Expo は、JavaScript と React を使用して Android、iOS、Web 用のユニバーサル ネイティブ アプリを作成するためのオープンソース プラットフォームです。ネイティブ開発環境の管理に伴う複雑さの多くを抽象化する一連のツールとサービスを提供することで、モバイル アプリの構築と展開のプロセスを簡素化します。 Expo を使用すると、開発者はネイティブ コードを構成することなく、実際のデバイスやエミュレータ上でアプリを開発およびテストできるため、開発プロセスが迅速化され、iOS や Android 開発の豊富な経験がない人でもアクセスしやすくなります。",
  "firebase_desc": "Firebase は、Google が提供する包括的なアプリ開発プラットフォームであり、開発者がアプリを構築、改善、成長させるのに役立つ幅広いツールとサービスを提供します。そのサービスは、ビルド、リリースと監視、エンゲージの 3 つの主要カテゴリに分類されており、開発から展開、分析に至るアプリ開発ライフサイクル全体をカバーしています。",
  "framer_motion_desc": "Framer Motion は、React アプリケーションでアニメーションやインタラクティブなアニメーションを作成するための人気のあるオープンソース React ライブラリです。シンプルでありながら強力になるように設計されており、Web アプリケーションのユーザー エクスペリエンスを向上させるのに役立つ包括的なアニメーション機能スイートを提供します。 Framer Motion は、複雑なアニメーションの作成に伴う複雑さの多くを抽象化しながら、アニメーションに対する高度な制御を提供します。",
  "french": "フランス語",
  "german": "ドイツ語",
  "hello_world": "こんにちは、世界 👋🏼 私の名前はティモシー カイシュです",
  "hours_short": "時間",
  "in_development": "開発中",
  "japanese": "日本語",
  "learn_more": "もっと詳しく知る",
  "love_what_i_do": "自分のやっていることは大好きです!",
  "minutes_short": "分",
  "more_areas_of_expertise": "さらなる専門分野",
  "my_skillset": "私のスキルセット",
  "nextjs_desc": "Next.js は、Vercel (旧名 Zeit) によって作成されたオープンソースの React フロントエンド開発 Web フレームワークで、サーバー側のレンダリングや React ベースの Web アプリケーションの静的 Web サイトの生成などの機能を有効にします。開発者が React を使用して高速でスケーラブルで使いやすい Web アプリケーションを簡単に構築できるように設計されています。",
  "not_including_today": "今日は含まない",
  "portuguese": "ポルトガル語",
  "postgresql_desc": "PostgreSQL (多くの場合、単に Postgres) は、特に複雑なデータ ワークロードを管理する際の信頼性、堅牢性、パフォーマンスで知られる高度なオープンソース オブジェクト リレーショナル データベース システムです。 PostgreSQL は 30 年以上のエンジニアリングを経て開発、改良され、そのアーキテクチャ、データの整合性、および広範な機能セットで高い評価を誇っています。",
  "react_desc": "React は、Web アプリケーション用の高速でインタラクティブなユーザー インターフェイスを構築するための JavaScript ライブラリです。これはコンポーネントベースであるため、開発者はページをリロードせずにデータを変更できる大規模な Web アプリケーションを作成できます。 React Native は、React のアプローチをモバイル アプリ開発に拡張します。 Webview を通じて Web アプリのモバイル アプリ バージョンを生成するツールとは異なり、React Native は Android と iOS の両方のプラットフォーム向けに真のネイティブ アプリを生成します。 React と同じ設計を使用しているため、宣言型コンポーネントからリッチなモバイル UI を作成できます。 React Native では、JavaScript と React を使用して UI を作成しますが、フレームワークはコンポーネントをプラットフォーム ネイティブ コンポーネントに変換し、アプリがネイティブ プラットフォーム機能にアクセスして使用できるようにします。",
  "russian": "ロシア語",
  "since_date": "%{date} 以降",
  "since_elipsis": "以来...",
  "spanish": "スペイン語",
  "supabase_desc": "Supabase は、オープンソースの Firebase の代替品であり、開発者にアプリケーションを迅速に構築および拡張するためのツール スイートを提供します。 Web アプリケーションやモバイル アプリケーションに通常必要とされる主要なバックエンド サービスを組み合わせて提供し、開発者を特定のフレームワークやテクノロジーに拘束することなく開発速度を向上させることを目的としています。",
  "top_editors": "トップエディター",
  "top_editors__description": "これらは、時間数に基づいて、私が最も多くの時間を費やした編集者です。",
  "top_languages": "人気の言語",
  "top_languages__description": "これらは、私が最も多くの時間を費やした上位 6 つの言語を時間単位で降順に示しています。",
  "total_hours_coding": "コーディングの合計時間",
  "total_unique_visitors": "合計ユニーク訪問者数",
  "with_blend_of_creativity": "創造性と技術的専門知識の融合により、私はフルスタック開発者として優れており、アイデアをダイナミックなモバイルおよび Web アプリケーションに変換して、ユーザー エンゲージメントを強化し、ビジネスを前進させます。"
}
