{
  "add_comment": "Adicionar comentário",
  "areas_of_expertise": "Áreas de experiência",
  "average_daily_hours_coding": "Codificação Média de Horas Diárias",
  "aws_desc": "Amazon Web Services (AWS) é uma plataforma de computação em nuvem abrangente e em evolução fornecida pela Amazon. Ele oferece uma combinação de ofertas de infraestrutura como serviço (IaaS), plataforma como serviço (PaaS) e software empacotado como serviço (SaaS). Os serviços da AWS podem oferecer às organizações ferramentas como poder de computação, armazenamento de banco de dados e serviços de entrega de conteúdo.",
  "back": "Voltar",
  "business_card": "Cartão de visitas",
  "business_card_links": "Links de cartão de visita",
  "can_integrate_with_aws": "posso integrar com AWS",
  "can_integrate_with_firebase": "posso integrar com Firebase",
  "can_integrate_with_supabase": "posso integrar com Supabase",
  "chakra_ui_desc": "Chakra UI é uma biblioteca React UI moderna, acessível e simples de usar que fornece um conjunto de componentes React reutilizáveis ​​e combináveis. O objetivo é tornar mais fácil para os desenvolvedores criarem interfaces de usuário bonitas, responsivas e acessíveis para seus aplicativos da web. O Chakra UI foi projetado tendo em mente a acessibilidade, garantindo que os aplicativos criados com ele sejam acessíveis ao maior público possível, incluindo pessoas com deficiência.",
  "chinese": "Chinês",
  "close": "Fechar",
  "coding_stats_disclaimer": "Os dados desta página vêm do meu perfil Wakatime e são atualizados diariamente. As estatísticas aqui mostram apenas a atividade de codificação monitorada pelo Wakatime, que começou a rastrear em 2023 e pode não incluir toda a codificação que faço. Isso é apenas para me divertir e para mostrar onde passo a maior parte do tempo, então aceite com cautela!",
  "coming_soon": "Em breve",
  "comment": "Comente",
  "comments": "Comentários",
  "contact_me": "Contate-me",
  "create_mobile_apps": "eu crio aplicativos móveis",
  "create_mobile_apps_with_expo": "eu crio aplicativos móveis com Expo",
  "create_mobile_apps_with_react_native": "eu crio aplicativos móveis com React Native",
  "create_websites": "eu crio sites",
  "create_websites_with_chakra": "eu crio sites com Chakra UI",
  "create_websites_with_nextjs": "eu crio sites com Next.js",
  "create_websites_with_react": "eu crio sites com React",
  "django_desc": "Django é uma estrutura web Python de alto nível que incentiva o desenvolvimento rápido e um design limpo e pragmático. Desenvolvido por desenvolvedores experientes, ele cuida de grande parte do incômodo do desenvolvimento web, para que você possa se concentrar em escrever seu aplicativo sem precisar reinventar a roda. É gratuito e de código aberto.",
  "english": "Inglês",
  "error_desc": "Ah, você encontrou nosso exclusivo 500 Club - um lugar que não achávamos que você encontraria (e, francamente, esperávamos que não). Enquanto nossa equipe técnica faz sua mágica para consertar o que está errado, vamos levá-lo de volta à segurança.",
  "expo_desc": "Expo é uma plataforma de código aberto para criar aplicativos nativos universais para Android, iOS e web com JavaScript e React. Ele simplifica o processo de construção e implantação de aplicativos móveis, fornecendo um conjunto de ferramentas e serviços que abstraem grande parte da complexidade envolvida no gerenciamento de ambientes de desenvolvimento nativos. Com a Expo, os desenvolvedores podem desenvolver e testar seus aplicativos em dispositivos e emuladores reais sem precisar configurar código nativo, tornando o processo de desenvolvimento mais rápido e acessível para quem não tem muita experiência com desenvolvimento para iOS ou Android.",
  "firebase_desc": "Firebase é uma plataforma abrangente de desenvolvimento de aplicativos fornecida pelo Google, que oferece uma ampla variedade de ferramentas e serviços para ajudar os desenvolvedores a criar, melhorar e expandir seus aplicativos. Seus serviços são divididos em três categorias principais: Build, Release & Monitor e Engage, cobrindo todo o ciclo de vida de desenvolvimento de aplicativos, desde o desenvolvimento até a implantação e análise.",
  "framer_motion_desc": "Framer Motion é uma biblioteca React de código aberto popular para criar animações e animações interativas em aplicativos React. Ele foi projetado para ser simples, mas poderoso, oferecendo um conjunto abrangente de recursos de animação que podem ajudar a aprimorar a experiência do usuário em aplicativos da web. Framer Motion fornece um alto nível de controle sobre animações enquanto abstrai grande parte da complexidade envolvida na criação de animações complexas.",
  "french": "Francês",
  "front": "Frente",
  "german": "Alemão",
  "go_home": "Ir para casa",
  "hello_world": "Olá, mundo 👋🏼 Meu nome é Timothy Caish, e",
  "hours_short": "hrs",
  "in_development": "Em desenvolvimento",
  "japanese": "Japonês",
  "learn_more": "Saber mais",
  "like": "Curtir",
  "loading": "Carregando...",
  "love_what_i_do": "eu amo o que faço!",
  "minutes_short": "mins",
  "mobile_app": "Aplicativo móvel",
  "more_areas_of_expertise": "Mais áreas de especialização",
  "nextjs_desc": "Next.js é uma estrutura web de desenvolvimento front-end React de código aberto criada por Vercel (anteriormente conhecido como Zeit) que permite funcionalidades como renderização no lado do servidor e geração de sites estáticos para aplicativos web baseados em React. Ele foi projetado para facilitar aos desenvolvedores a criação de aplicativos da web rápidos, escaláveis ​​e fáceis de usar com React.",
  "no_comments_yet": "Ainda não há comentários para este item do portfólio. Seja o primeiro a deixar um comentário!",
  "not_found_desc": "Ops! Parece que você descobriu o grande vazio digital. Infelizmente, a página que você procura desapareceu no ciberespaço. Mas não se preocupe! Nossos melhores detetives digitais estão cuidando do caso. Enquanto isso, vamos levar você para casa.",
  "not_including_today": "Não incluindo hoje",
  "npm_package": "Pacote NPM",
  "portfolio_descriptions": {
    "id-1": "Apresentando uma solução abrangente e personalizável para gerenciar o consentimento de cookies em seus aplicativos React! Nosso pacote inclui um conjunto de componentes poderosos projetados para tornar a implementação do consentimento de cookies simples e compatível com as preferências do usuário."
  },
  "portuguese": "Português",
  "postgresql_desc": "PostgreSQL, muitas vezes simplesmente Postgres, é um sistema de banco de dados relacional de objeto avançado e de código aberto, conhecido por sua confiabilidade, robustez e desempenho, especialmente ao gerenciar cargas de trabalho de dados complexas. O PostgreSQL foi desenvolvido e aprimorado ao longo de mais de 30 anos de engenharia, ostentando uma forte reputação por sua arquitetura, integridade de dados e amplo conjunto de recursos.",
  "react_desc": "React é uma biblioteca JavaScript para construção de interfaces de usuário rápidas e interativas para aplicações web. É baseado em componentes, permitindo aos desenvolvedores criar grandes aplicações web que podem alterar dados, sem recarregar a página. React Native estende a abordagem do React para desenvolvimento de aplicativos móveis. Ao contrário das ferramentas que geram versões de aplicativos móveis de um aplicativo da web por meio de webviews, o React Native produz aplicativos verdadeiramente nativos para plataformas Android e iOS. Ele usa o mesmo design do React, permitindo compor uma UI móvel rica a partir de componentes declarativos. Com React Native, você escreve sua UI usando JavaScript e React, mas a estrutura traduz seus componentes em componentes nativos da plataforma, permitindo que seu aplicativo acesse e use recursos nativos da plataforma.",
  "released": "Lançado",
  "routes": {
    "contact": "Contato",
    "expertise": "Perícia",
    "home": "Lar",
    "portfolio": "Portfólio"
  },
  "russian": "Russo",
  "since_date": "Desde %{date}",
  "since_elipsis": "Desde...",
  "spanish": "Espanhol",
  "top_editors": "Principais editores",
  "top_editors__description": "Esses são os editores com quem passei mais tempo, com base na quantidade de horas.",
  "top_languages": "Principais idiomas",
  "top_languages__description": "Estes são os seis principais idiomas com os quais passei mais tempo, em ordem decrescente por horas.",
  "total_hours_coding": "Codificação total de horas",
  "total_unique_visitors": "Total de visitantes únicos",
  "website": "Local na rede Internet",
  "with_blend_of_creativity": "Com uma mistura de criatividade e conhecimento técnico, me destaquei como desenvolvedor full stack, transformando ideias em aplicativos móveis e web dinâmicos que melhoram o envolvimento do usuário e impulsionam os negócios."
}
