{
  "average_daily_hours_coding": "Кодирование среднесуточных часов",
  "aws_desc": "Amazon Web Services (AWS) — это комплексная, развивающаяся платформа облачных вычислений, предоставляемая Amazon. Он предлагает сочетание инфраструктуры как услуги (IaaS), платформы как услуги (PaaS) и пакетного программного обеспечения как услуги (SaaS). Сервисы AWS могут предложить организациям такие инструменты, как вычислительная мощность, хранилище баз данных и услуги доставки контента.",
  "can_integrate_with_aws": "Я могу интегрироваться с AWS",
  "can_integrate_with_firebase": "Я могу интегрироваться с Firebase",
  "can_integrate_with_supabase": "Я могу интегрироваться с Supabase",
  "chakra_ui_desc": "Chakra UI — это современная, доступная и простая в использовании библиотека пользовательского интерфейса React, которая предоставляет набор повторно используемых и компонуемых компонентов React. Его цель — облегчить разработчикам создание красивых, отзывчивых и доступных пользовательских интерфейсов для своих веб-приложений. Пользовательский интерфейс Chakra разработан с учетом доступности, гарантируя, что приложения, созданные с его помощью, будут доступны как можно более широкой аудитории, включая людей с ограниченными возможностями.",
  "chinese": "Китайский",
  "coding_stats_disclaimer": "Данные на этой странице взяты из моего профиля Wakatime и обновляются ежедневно. Статистика здесь показывает только активность кодирования, отслеживаемую Wakatime, которая начала отслеживать в 2023 году, и может не включать все кодирование, которое я делаю. Это сделано только для развлечения и для того, чтобы показать, где я провожу большую часть своего времени, так что относитесь к этому с недоверием!",
  "contact_me": "Свяжитесь со мной",
  "create_mobile_apps": "Я создаю мобильные приложения",
  "create_mobile_apps_with_expo": "Я создаю мобильные приложения с помощью Expo",
  "create_mobile_apps_with_react_native": "Я создаю мобильные приложения с помощью React Native",
  "create_websites": "Я создаю веб-сайты",
  "create_websites_with_chakra": "Я создаю веб-сайты с пользовательским интерфейсом Chakra",
  "create_websites_with_nextjs": "Я создаю веб-сайты с помощью Next.js",
  "create_websites_with_react": "Я создаю веб-сайты с помощью React",
  "django_desc": "Django — это веб-фреймворк Python высокого уровня, который способствует быстрой разработке и чистому, прагматичному дизайну. Созданный опытными разработчиками, он берет на себя большую часть хлопот веб-разработки, поэтому вы можете сосредоточиться на написании своего приложения, не изобретая велосипед. Это бесплатно и с открытым исходным кодом.",
  "english": "английский",
  "expo_desc": "Expo — это платформа с открытым исходным кодом для создания универсальных нативных приложений для Android, iOS и Интернета с использованием JavaScript и React. Он упрощает процесс создания и развертывания мобильных приложений, предоставляя набор инструментов и сервисов, которые позволяют избежать большей части сложностей, связанных с управлением собственными средами разработки. С помощью Expo разработчики могут разрабатывать и тестировать свои приложения на реальных устройствах и эмуляторах без необходимости настройки собственного кода, что делает процесс разработки более быстрым и доступным для тех, кто не имеет большого опыта разработки для iOS или Android.",
  "firebase_desc": "Firebase — это комплексная платформа для разработки приложений, предоставляемая Google и предлагающая широкий спектр инструментов и услуг, помогающих разработчикам создавать, улучшать и развивать свои приложения. Его услуги разделены на три основные категории: «Создание», «Выпуск и мониторинг» и «Вовлечение», охватывающие весь жизненный цикл разработки приложений: от разработки до развертывания и аналитики.",
  "framer_motion_desc": "Framer Motion — популярная библиотека React с открытым исходным кодом для создания анимации и интерактивной анимации в приложениях React. Он создан простым, но мощным и предлагает полный набор функций анимации, которые могут помочь улучшить взаимодействие с пользователем в веб-приложениях. Framer Motion обеспечивает высокий уровень контроля над анимацией, абстрагируя при этом большую часть сложностей, связанных с созданием сложной анимации.",
  "french": "французский",
  "german": "немецкий",
  "hello_world": "Привет, мир 👋🏼 Меня зовут Тимоти Кейш, и",
  "hours_short": "часы",
  "in_development": "В развитие",
  "japanese": "японский",
  "learn_more": "Узнать больше",
  "love_what_i_do": "Мне нравится то, что я делаю!",
  "minutes_short": "минуты",
  "more_areas_of_expertise": "Больше областей знаний",
  "my_skillset": "Мой набор навыков",
  "nextjs_desc": "Next.js — это веб-фреймворк для фронтальной разработки React с открытым исходным кодом, созданный Vercel (ранее известный как Zeit), который обеспечивает такие функции, как рендеринг на стороне сервера и создание статических веб-сайтов для веб-приложений на основе React. Он создан для того, чтобы разработчикам было проще создавать быстрые, масштабируемые и удобные веб-приложения с помощью React.",
  "not_including_today": "Не считая сегодняшнего дня",
  "portuguese": "португальский",
  "postgresql_desc": "PostgreSQL, часто просто Postgres, представляет собой продвинутую объектно-реляционную систему баз данных с открытым исходным кодом, известную своей надежностью, отказоустойчивостью и производительностью, особенно при управлении сложными рабочими нагрузками данных. PostgreSQL разрабатывался и совершенствовался в течение более чем 30 лет разработки и имеет прочную репутацию благодаря своей архитектуре, целостности данных и обширному набору функций.",
  "react_desc": "React — это библиотека JavaScript для создания быстрых и интерактивных пользовательских интерфейсов для веб-приложений. Он основан на компонентах, что позволяет разработчикам создавать большие веб-приложения, которые могут изменять данные без перезагрузки страницы. React Native расширяет подход React к разработке мобильных приложений. В отличие от инструментов, которые создают версии веб-приложений для мобильных устройств посредством веб-просмотров, React Native создает действительно нативные приложения для платформ Android и iOS. Он использует тот же дизайн, что и React, что позволяет вам создавать богатый мобильный пользовательский интерфейс из декларативных компонентов. Используя React Native, вы пишете свой пользовательский интерфейс с использованием JavaScript и React, но инфраструктура преобразует ваши компоненты в собственные компоненты платформы, позволяя вашему приложению получать доступ к собственным возможностям платформы и использовать их.",
  "russian": "русский",
  "since_date": "С %{date} г.",
  "since_elipsis": "С...",
  "spanish": "испанский",
  "top_editors": "Лучшие редакторы",
  "top_editors__description": "Это редакторы, с которыми я провел больше всего времени, исходя из количества часов.",
  "top_languages": "Лучшие языки",
  "top_languages__description": "Это шесть самых популярных языков, с которыми я провел больше всего времени, в порядке убывания количества часов.",
  "total_hours_coding": "Общее количество часов кодирования",
  "total_unique_visitors": "Всего уникальных посетителей",
  "with_blend_of_creativity": "Обладая сочетанием креативности и технических знаний, я преуспеваю в качестве разработчика полного цикла, превращая идеи в динамичные мобильные и веб-приложения, которые повышают вовлеченность пользователей и продвигают бизнес вперед."
}
